#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <math.h>
#include <locale.h>

void main()
{
	float  h, w, d, t, t1, t2, p1, p2, p3, v1, v2, v3, v4, v5, m1, m2, m3, m4, m5;
	int n, m6;
	setlocale(LC_ALL, "Russian");
	printf("Введите высоту задней стенки в метрах");
	scanf("%f", &h);
	printf("Введите ширину задней стенки в метрах");
	scanf("%f", &w);
	printf("Ведите глубину боковой стенки в метрах");
	scanf("%f", &d);
	if ((h < 1.8) || (h > 2.2))
	{
		printf("Ошибка");
		return;
	}
	if ((w < 0.8) || (w > 1.2))
	{
		printf("Ошибка");
		return;
	}
	if ((d < 0.5) || (d > 0.9))
	{
		printf("Ошибка");
		return;
	}
	t = 0.005f; //толщина задней стенки м
	t1 = 0.015f; //толщина боковой стенки м
	t2 = 0.01f; //толщина двери м
	printf("введите плотность дсп кг/м^3");
	scanf("%f", &p1);
	printf("введите плотность двп кг/м^3");
	scanf("%f", &p2);
	printf("введите плотность дерева кг/м^3");
	scanf("%f", &p3);
	v1 = h * w * t; //объем задней стенки м^3
	m1 = v1 * p2; //масса задней стенки кг
	v2 = h * d * t1; //объем боковой стенки м^3
	m2 = v2 * p1 * 2; //масса боковых стенок кг
	v3 = w * d * t1; //объем крышки м^3
	m3 = v3 * p1 * 2; //масса крышек кг
	v4 = h * w * t2; //объем дверей м^3
	m4 = v4 * p3; //масса дверей кг
	n = (h - 2.0f * 0.015f) / (0.4f + 0.015f); //кол-во полок
	//справа в выражении может получиться вещественное число, но т.к пременная n имеет тип int, колличество полок будет целым числом, точнее целой частью вещественного числа, что нам и нужно, т.к округлять колличество полок в большую сторону мы не должны!
	v5 = (d - 0.005f)  * (w - 2.0f * 0.015f) * t1; //объем одной полки
	m5 = v5 * p1 * n; //масса всех полок кг
	m6 = (m1 + m2 + m3 + m4 + m5);
	printf("Масса шкафа (кг)=""%d", m6);
	system("pause");
}